---
title: ComponentRepeaterIterator
classe: Autodesk.Revit.DB.ComponentRepeaterIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ComponentRepeaterIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ComponentRepeaterSlot Current { get; }` | `componentRepeaterIterator.Current` | ComponentRepeaterSlot |
| `Boolean IsValidObject { get; }` | `componentRepeaterIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `componentRepeaterIterator.Dispose()` | Void |
| `ComponentRepeaterSlot GetCurrent()` | `componentRepeaterIterator.GetCurrent()` | ComponentRepeaterSlot |
| `Boolean IsDone()` | `componentRepeaterIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `componentRepeaterIterator.MoveNext()` | Boolean |
| `Void Reset()` | `componentRepeaterIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```